# IFCParameter Template Get Property Set Names Method

Source: https://www.revitapidocs.com/2026/deb275c9-c490-380c-f0fe-132360c4515d.htm

---

| IFCParameter Template Get Property Set Names Method |
| --- |

Creates an array of property set names contained in the template according to provided selection type.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<string> GetPropertySetNames(
	PropertySetupType propertySetupType,
	PropertySelectionType propertySelectionType
)
```

```
Public Function GetPropertySetNames (
	propertySetupType As PropertySetupType,
	propertySelectionType As PropertySelectionType
) As IList(Of String)
```

```
public:
IList<String^>^ GetPropertySetNames(
	PropertySetupType propertySetupType,
	PropertySelectionType propertySelectionType
)
```

```
member GetPropertySetNames :
        propertySetupType : PropertySetupType *
        propertySelectionType : PropertySelectionType -> IList<string>
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

propertySelectionType PropertySelectionType
:   The property selection type.

#### Return Value

IList String
The array of the property set names in the template. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace